backend/controllers/SettingController.php

SELECT * FROM `qt_category` WHERE `alias`='course'
SELECT * FROM `qt_category` WHERE `alias`='question'
SELECT * FROM `qt_category` WHERE `alias`='word'
SELECT * FROM `qt_category` WHERE `alias`='information'
---
    public function actionCreateSitemap()
    {
        //课程分类
        $courseCategory = Category::findOne(['alias' => 'course']);
        $courseDescendants = Category::getDescendants($courseCategory['id']);
        $courseCid = ArrayHelper::getColumn($courseDescendants, 'id');
        $courseCid[] = $courseCategory['id'];
        //常见问题分类
        $questionCategory = Category::findOne(['alias' => 'question']);
        $questionDescendants = Category::getDescendants($questionCategory['id']);
        $questionCid = ArrayHelper::getColumn($questionDescendants, 'id');
        $questionCid[] = $questionCategory['id'];

        //教程文档分类
        $wordCategory = Category::findOne(['alias' => 'word']);
        $wordDescendants = Category::getDescendants($wordCategory['id']);
        $wordCid = ArrayHelper::getColumn($wordDescendants, 'id');
        $wordCid[] = $wordCategory['id'];

        //行业资讯分类
        $informationCategory = Category::findOne(['alias' => 'information']);

SELECT * FROM `qt_category` ORDER BY `id` DESC
---
        $changefreqValue = $dom->createTextNode('Daily');
        $itemChangefreq->appendChild($changefreqValue);
        //分类
        $CategoryModels = Category::find()->orderBy('id desc')->all();

SELECT * FROM `qt_article` WHERE `status`=1 ORDER BY `id` DESC
---
            $itemChangefreq->appendChild($changefreqValue);
        }
        //文章
        $models = Article::find()->where(['status'=>Article::ARTICLE_PUBLISHED])->orderBy('id desc')->all();