common/models/Category.php

SELECT * FROM `qt_category` ORDER BY `sort`, `parent_id`
---
    protected static function _getCategories()
    {
        return self::find()->orderBy("sort asc,parent_id asc")->asArray()->all();